app/Controllers/Home.php

    public function index()
    {
        $taskModel = new TaskModel();

        $data['tasks'] = $taskModel
            ->where('task_date', date('Y-m-d'))
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-29'
ORDER BY `id` ASC