app/Controllers/Tasks.php

    public function index()
    {
        $taskModel = new TaskModel();

        $data['tasks'] = $taskModel
            ->orderBy('task_date', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
ORDER BY `task_date` ASC